Revit 2026 API

# PointCloudColorSettings Methods

---

The PointCloudColorSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source settings to this object. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Check if the contents of two settings are equal. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PointCloudColorSettings Class

Autodesk.Revit.DB.PointClouds Namespace